tutorials/DLbuoyantPimpleFoam/other/system/extrudeMeshDict_inlet
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}

constructFrom mesh;
sourceCase ".";
sourcePatches    (inlet);
extrudeType      patchNormal;
exposedPatchName inlet;
direction (-1 0 0);

flipNormals false;

extrudeModel linearDirection;

expansionRatio 1.03;
firstLayerThickness 0.002;
nLayers 45;

linearDirectionCoeffs
{
    direction (-1 0 0);
    thickness 0.1;
}

mergeFaces false;
mergeTol 0;
