tutorials/DLbuoyantPimpleFoam/other/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    /*{
        name    highRes;
        type    cellSet;
        action  new;
        source  zoneToCell;
        sourceInfo
        {
            name inner;
        }
    }*/

    {
        name    highRes2;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
	    box (0.01 0.000 -0.001) (0.05 0.016 0.025);
        }
    }

);

// ************************************************************************* //
